---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RvtLinkFileNameWithoutExt
source: html/23032c4b-4ae6-25d6-2266-8de8905d3e74.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RvtLinkFileNameWithoutExt Property

"File Name"

## Syntax (C#)
```csharp
public static ForgeTypeId RvtLinkFileNameWithoutExt { get; }
```